<template>
  <section class="template section">
    <Overlay v-model="isOpen" />
    <div class="container" ref="pageExit">
      <ButtonBack class="template__button-back" :to="'/about'" />

      <div class="template__content">
        <div class="template__wrapper scrollbar">
          <p class="template__text">
            Мы создали нашу некоммерческую организацию чтобы достичь следующих целей:
            - общество должно знать всё о способах сортировки отходов, адресах мест их переработки;
            - экологичные пространства (офисные, производственные, лично-бытовые) должны применяться повсеместно;
            - принцип «Жить экологично» должен стать неотъемлемой частью развитого общества.
            Для решения наших задач мы проводим эко-занятия в образовательных учреждениях, акции и эко-квесты, готовим предложения по сокращению потребления ресурсов, внедряем эко-привычки в кафе и офисах.
            Мы создали нашу некоммерческую организацию чтобы достичь следующих целей:
            - общество должно знать всё о способах сортировки отходов, адресах мест их переработки;
            - экологичные пространства (офисные, производственные, лично-бытовые) должны применяться повсеместно;
            - принцип «Жить экологично» должен стать неотъемлемой частью развитого общества.
            Для решения наших задач мы проводим эко-занятия в образовательных учреждениях, акции и эко-квесты, готовим предложения по сокращению потребления ресурсов, внедряем эко-привычки в кафе и офисах.
            Мы создали нашу некоммерческую организацию чтобы достичь следующих целей:
            - общество должно знать всё о способах сортировки отходов, адресах мест их переработки;
            - экологичные пространства (офисные, производственные, лично-бытовые) должны применяться повсеместно;
            - принцип «Жить экологично» должен стать неотъемлемой частью развитого общества.
            Для решения наших задач мы проводим эко-занятия в образовательных учреждениях, акции и эко-квесты, готовим предложения по сокращению потребления ресурсов, внедряем эко-привычки в кафе и офисах.
            Мы создали нашу некоммерческую организацию чтобы достичь следующих целей:
            - общество должно знать всё о способах сортировки отходов, адресах мест их переработки;
            - экологичные пространства (офисные, производственные, лично-бытовые) должны применяться повсеместно;
            - принцип «Жить экологично» должен стать неотъемлемой частью развитого общества.
            Для решения наших задач мы проводим эко-занятия в образовательных учреждениях, акции и эко-квесты, готовим предложения по сокращению потребления ресурсов, внедряем эко-привычки в кафе и офисах.
            Мы создали нашу некоммерческую организацию чтобы достичь следующих целей:
            - общество должно знать всё о способах сортировки отходов, адресах мест их переработки;
            - экологичные пространства (офисные, производственные, лично-бытовые) должны применяться повсеместно;
            - принцип «Жить экологично» должен стать неотъемлемой частью развитого общества.
            Для решения наших задач мы проводим эко-занятия в образовательных учреждениях, акции и эко-квесты, готовим предложения по сокращению потребления ресурсов, внедряем эко-привычки в кафе и офисах.
            Мы создали нашу некоммерческую организацию чтобы достичь следующих целей:
            - общество должно знать всё о способах сортировки отходов, адресах мест их переработки;
            - экологичные пространства (офисные, производственные, лично-бытовые) должны применяться повсеместно;
            - принцип «Жить экологично» должен стать неотъемлемой частью развитого общества.
            Для решения наших задач мы проводим эко-занятия в образовательных учреждениях, акции и эко-квесты, готовим предложения по сокращению потребления ресурсов, внедряем эко-привычки в кафе и офисах.
            Мы создали нашу некоммерческую организацию чтобы достичь следующих целей:
            - общество должно знать всё о способах сортировки отходов, адресах мест их переработки;
            - экологичные пространства (офисные, производственные, лично-бытовые) должны применяться повсеместно;
            - принцип «Жить экологично» должен стать неотъемлемой частью развитого общества.
            Для решения наших задач мы проводим эко-занятия в образовательных учреждениях, акции и эко-квесты, готовим предложения по сокращению потребления ресурсов, внедряем эко-привычки в кафе и офисах.
            Мы создали нашу некоммерческую организацию чтобы достичь следующих целей:
            - общество должно знать всё о способах сортировки отходов, адресах мест их переработки;
            - экологичные пространства (офисные, производственные, лично-бытовые) должны применяться повсеместно;
            - принцип «Жить экологично» должен стать неотъемлемой частью развитого общества.
            Для решения наших задач мы проводим эко-занятия в образовательных учреждениях, акции и эко-квесты, готовим предложения по сокращению потребления ресурсов, внедряем эко-привычки в кафе и офисах.
            Мы создали нашу некоммерческую организацию чтобы достичь следующих целей:
            - общество должно знать всё о способах сортировки отходов, адресах мест их переработки;
            - экологичные пространства (офисные, производственные, лично-бытовые) должны применяться повсеместно;
            - принцип «Жить экологично» должен стать неотъемлемой частью развитого общества.
            Для решения наших задач мы проводим эко-занятия в образовательных учреждениях, акции и эко-квесты, готовим предложения по сокращению потребления ресурсов, внедряем эко-привычки в кафе и офисах.
          </p>
        </div>
        <div class="template__container-slider">
          <v-slider class="template__swiper" name="view-shop" :options="sliderOptions">
            <div class="swiper-slide">
              <div class="template__swiper-img">
                <img src="../../assets/img/targets/targets.jpg" alt="img_1" />
              </div>
            </div>
            <div class="swiper-slide">
              <div class="template__swiper-img">
                <img src="../../assets/img/targets/targets.jpg" alt="img_1" />
              </div>
            </div>
            <div class="swiper-slide">
              <div class="template__swiper-img">
                <img src="../../assets/img/targets/targets.jpg" alt="img_1" />
              </div>
            </div>
            <div class="swiper-slide">
              <div class="template__swiper-img">
                <img src="../../assets/img/targets/targets.jpg" alt="img_1" />
              </div>
            </div>
            <div class="swiper-slide">
              <div class="template__swiper-img">
                <img src="../../assets/img/targets/targets.jpg" alt="img_1" />
              </div>
            </div>
            <div class="swiper-slide">
              <div class="template__swiper-img">
                <img src="../../assets/img/targets/targets.jpg" alt="img_1" />
              </div>
            </div>
          </v-slider>
        </div>
      </div>

      <Breadcrumbs :links="links" />
    </div>
  </section>
</template>

<script>
import VSlider from "../controls/VSlider.vue";
import ButtonBack from "../controls/ButtonBack.vue";
import Breadcrumbs from "../controls/Breadcrumbs.vue";
import Overlay from "../Background/Overlay";

const sliderOptions = {
  spaceBetween: 24,
  slidesPerView: 1,
  grabCursor: true,
  autoHeight: true,
  simulateTouch: false,

  navigation: {
    nextEl: ".swiper-button-next",
    prevEl: ".swiper-button-prev"
  },
  pagination: {
    el: ".swiper-pagination",
    type: "bullets",
    clickable: true
  }
};

export default {
  components: {
    VSlider,
    ButtonBack,
    Breadcrumbs,
    Overlay
  },

  data() {
    return {
      links: [
        {
          name: "Цели",
          to: "/about/template"
        },
        {
          name: "Деятельность",
          to: "/about"
        },
        {
          name: "Партнеры",
          to: "/about/partners"
        }
      ],
      isOpen: false
    };
  },

  computed: {
    sliderOptions() {
      return sliderOptions;
    }
  },
  mounted() {
    let { pageExit } = this.$refs;
    pageExit.classList.add("container--contact");
    this.isOpen = true;
  },
  beforeRouteLeave(to, from, next) {
    let { pageExit } = this.$refs;
    pageExit.classList.remove("container--contact");
    pageExit.classList.add("container--contact-exit");
    this.isOpen = false;
    setTimeout(next, 400);
  }
};
</script>
