<template>
  <section class="template section">
    <Overlay v-model="isOpen" />
    <div class="container" ref="pageExit">
      <ButtonBack class="template__button-back" :to="'/about'" />

      <div class="template__content">
        <div
          class="template__wrapper scrollbar"
          :class="{'template__wrapper--full': !items.length }"
        >
          <p class="template__text">
            Мы создали нашу некоммерческую организацию чтобы достичь следующих целей:
            - общество должно знать всё о способах сортировки отходов, адресах мест их переработки;
            - экологичные пространства (офисные, производственные, лично-бытовые) должны применяться повсеместно;
            - принцип «Жить экологично» должен стать неотъемлемой частью развитого общества.
            Для решения наших задач мы проводим эко-занятия в образовательных учреждениях, акции и эко-квесты, готовим предложения по сокращению потребления ресурсов, внедряем эко-привычки в кафе и офисах.
            Мы создали нашу некоммерческую организацию чтобы достичь следующих целей:
            - общество должно знать всё о способах сортировки отходов, адресах мест их переработки;
            - экологичные пространства (офисные, производственные, лично-бытовые) должны применяться повсеместно;
            - принцип «Жить экологично» должен стать неотъемлемой частью развитого общества.
            Для решения наших задач мы проводим эко-занятия в образовательных учреждениях, акции и эко-квесты, готовим предложения по сокращению потребления ресурсов, внедряем эко-привычки в кафе и офисах.
            Мы создали нашу некоммерческую организацию чтобы достичь следующих целей:
            - общество должно знать всё о способах сортировки отходов, адресах мест их переработки;
            - экологичные пространства (офисные, производственные, лично-бытовые) должны применяться повсеместно;
            - принцип «Жить экологично» должен стать неотъемлемой частью развитого общества.
            Для решения наших задач мы проводим эко-занятия в образовательных учреждениях, акции и эко-квесты, готовим предложения по сокращению потребления ресурсов, внедряем эко-привычки в кафе и офисах.
            Мы создали нашу некоммерческую организацию чтобы достичь следующих целей:
            - общество должно знать всё о способах сортировки отходов, адресах мест их переработки;
            - экологичные пространства (офисные, производственные, лично-бытовые) должны применяться повсеместно;
            - принцип «Жить экологично» должен стать неотъемлемой частью развитого общества.
            Для решения наших задач мы проводим эко-занятия в образовательных учреждениях, акции и эко-квесты, готовим предложения по сокращению потребления ресурсов, внедряем эко-привычки в кафе и офисах.
            Мы создали нашу некоммерческую организацию чтобы достичь следующих целей:
            - общество должно знать всё о способах сортировки отходов, адресах мест их переработки;
            - экологичные пространства (офисные, производственные, лично-бытовые) должны применяться повсеместно;
            - принцип «Жить экологично» должен стать неотъемлемой частью развитого общества.
            Для решения наших задач мы проводим эко-занятия в образовательных учреждениях, акции и эко-квесты, готовим предложения по сокращению потребления ресурсов, внедряем эко-привычки в кафе и офисах.
            Мы создали нашу некоммерческую организацию чтобы достичь следующих целей:
            - общество должно знать всё о способах сортировки отходов, адресах мест их переработки;
            - экологичные пространства (офисные, производственные, лично-бытовые) должны применяться повсеместно;
            - принцип «Жить экологично» должен стать неотъемлемой частью развитого общества.
            Для решения наших задач мы проводим эко-занятия в образовательных учреждениях, акции и эко-квесты, готовим предложения по сокращению потребления ресурсов, внедряем эко-привычки в кафе и офисах.
            Мы создали нашу некоммерческую организацию чтобы достичь следующих целей:
            - общество должно знать всё о способах сортировки отходов, адресах мест их переработки;
            - экологичные пространства (офисные, производственные, лично-бытовые) должны применяться повсеместно;
            - принцип «Жить экологично» должен стать неотъемлемой частью развитого общества.
            Для решения наших задач мы проводим эко-занятия в образовательных учреждениях, акции и эко-квесты, готовим предложения по сокращению потребления ресурсов, внедряем эко-привычки в кафе и офисах.
            Мы создали нашу некоммерческую организацию чтобы достичь следующих целей:
            - общество должно знать всё о способах сортировки отходов, адресах мест их переработки;
            - экологичные пространства (офисные, производственные, лично-бытовые) должны применяться повсеместно;
            - принцип «Жить экологично» должен стать неотъемлемой частью развитого общества.
            Для решения наших задач мы проводим эко-занятия в образовательных учреждениях, акции и эко-квесты, готовим предложения по сокращению потребления ресурсов, внедряем эко-привычки в кафе и офисах.
            Мы создали нашу некоммерческую организацию чтобы достичь следующих целей:
            - общество должно знать всё о способах сортировки отходов, адресах мест их переработки;
            - экологичные пространства (офисные, производственные, лично-бытовые) должны применяться повсеместно;
            - принцип «Жить экологично» должен стать неотъемлемой частью развитого общества.
            Для решения наших задач мы проводим эко-занятия в образовательных учреждениях, акции и эко-квесты, готовим предложения по сокращению потребления ресурсов, внедряем эко-привычки в кафе и офисах.
            {{getTemplateDate}}
          </p>
        </div>
        <div v-if="items.length" class="template__container-slider">
          <v-slider class="template__swiper" name="view-shop" :options="sliderOptions">
            <div
              class="swiper-slide"
              v-for="(item, index) in items"
              :key="index"
            >
              <div class="template__swiper-img">
                <img src="../../assets/img/targets/targets.jpg" alt="img_1" />
              </div>
            </div>
          </v-slider>
        </div>
      </div>

      <Breadcrumbs v-if="links.length && links.length !== 1" :links="links" />
    </div>
  </section>
</template>

<script>
const img = "/img/targets.56c06f8c.jpg";

import VSlider from "../controls/VSlider.vue";
import ButtonBack from "../controls/ButtonBack.vue";
import Breadcrumbs from "../controls/Breadcrumbs.vue";
import Overlay from "../Background/Overlay";

import { mapActions, mapGetters } from 'vuex';

const sliderOptions = {
  spaceBetween: 24,
  slidesPerView: 1,
  grabCursor: true,
  autoHeight: true,
  simulateTouch: false,

  navigation: {
    nextEl: ".swiper-button-next",
    prevEl: ".swiper-button-prev"
  },
  pagination: {
    el: ".swiper-pagination",
    type: "bullets",
    clickable: true
  }
};

export default {
  components: {
    VSlider,
    ButtonBack,
    Breadcrumbs,
    Overlay
  },

  data() {
    return {
      links: [
        {
          name: "Цели",
          to: "/about/targets"
        },
        {
          name: "Деятельность",
          to: "/about"
        },
        {
          name: "Партнеры",
          to: "/about/partners"
        }
      ],
      isOpen: false,
      items: [
        {
          img: img
        },
        {
          img: img
        },
        {
          img: img
        },
        {
          img: img
        },
        {
          img: img
        },
        {
          img: img
        }
      ]
    };
  },

  computed: {
    ...mapGetters(['getAllPages']),
    sliderOptions() {
      return sliderOptions;
    },

    getTemplateDate() {
      const template = {};
      const path = this.$route.path;
      const page = this.getAllPages.find(page => page.link.indexOf(path) !== -1)

      if (!page)
        return ''

      const parentId = page.parent;
      let links = [];

      for (let page of this.getAllPages) {
        let link = {};
        if (page.parent === parentId) {
          link.name = page.title.rendered;
          link.to = page.link.replace('https://eco-z.org', '');
        }

        links.push(link)
      }

      // console.log(links, page, template)
      // const arr = page.content.splice('<br />')
      console.log(template, page)
      return ''
    }
  },

  watch: {
    getAllPages() {
      this.fetchTemplate({data: this.getAllPages});
    }
  },

  methods: {
    ...mapActions(['fetchTemplate']),
  },

  created() {
    this.fetchTemplate({data: this.getAllPages});
  },

  mounted() {
    let { pageExit } = this.$refs;
    pageExit.classList.add("container--contact");
    this.isOpen = true;
  },

  beforeRouteLeave(to, from, next) {
    let { pageExit } = this.$refs;
    pageExit.classList.remove("container--contact");
    pageExit.classList.add("container--contact-exit");
    this.isOpen = false;
    setTimeout(next, 400);
  }
};
</script>
