<template>
  <div class="home">
    <Main v-bind:content="content"/>
  </div>
</template>

<script>
import Main from "../components/Main/Main";

export default {
  data: () => ({
    content:{
    title: "Экология — ответственность каждого",
    description: "Завод, офис и человек производят отходы ежедневно, а значит каждый вносит вклад в их появление. Общество имеет все возможности улучшить экологию вокруг себя. Хотите знать, с чего начать? Куда и какие продукты сдавать? Какие законы регулируют обращение с отходами? Как в офисе внедрить «зелёный подход»? Запишитесь на бесплатную консультацию и наш специалист свяжется с Вами.",
    links: [
      { title: "Записаться на консультацию", url: "#"},


    ]
    }
  }),
  name: "home",
  components: {
    Main
  }
};
</script>
