<template>
  <div class="school">
    <Header v-bind:content="content"/>
  </div>
</template>

<script>
import Header from "../components/Header/Header";

export default {
  data: () => ({
    content:{
    title: "Для школ и других образовательных учреждений",
    description: "60% активного времени учащиеся проводят в образовательном учреждении и вовлечены в учебный процесс. Поэтому именно в школах и колледжах должна появляться инфраструктура для воспитания экологической грамотности: от раздельного сбора до экологических привычках на всю жизнь. Если вы: педагог, родитель или представитель администрации образовательного учреждения; заполните заявку и мы свяжемся с вами для обсуждения деталей сотрудничества.",
    links: [
      { title: "Наш опыт", url: "#"},
      { title: "Услуги", url: "#" },
      
    ]
    }
  }),
  name: "school",
  components: {
    Header
  }
};
</script>




